In [1]:
import pandas as pd

In [2]:
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [3]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

 # Q1. Write a code to print the data present in the second row of the dataframe, df.

In [4]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

# Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

# loc is primarily used for labelindexing ,while . iloc is mainly used for integer indexing

# Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_dfthen find the output for both new_df.loc[2] and new_df.iloc[2].

In [5]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [6]:
df=df.reindex([3,0,1,2])

In [7]:
df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [8]:
df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

# bhot are different loc[2] used to labelindexing but iloc used to integer indexing

In [9]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]

df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [10]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.047339  0.785372  0.287142  0.630078  0.871870  0.789873
2  0.651220  0.608279  0.162164  0.515147  0.957687  0.873669
3  0.392533  0.719222  0.535273  0.038143  0.164375  0.896489
4  0.329194  0.119281  0.452081  0.142059  0.858060  0.966297
5  0.889668  0.521666  0.497825  0.696986  0.822888  0.598393
6  0.471381  0.248338  0.149043  0.950422  0.101585  0.038291

# Q4. Write a code to find the following statistical measurements for the above dataframe df1:
# (i) mean of each and every column present in the dataframe.
# (ii) standard deviation of column, ‘column_2’

In [11]:
df1.mean()

column_1    0.463556
column_2    0.500360
column_3    0.347255
column_4    0.495472
column_5    0.629411
column_6    0.693835
dtype: float64

In [12]:
df1['column_2'].std()

0.26456356813019183

# Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the mean of column, column_2. If you are getting errors in executing it then explain why.

In [13]:
string_var="hello"

In [14]:
df1=df1.loc[1:2,"column_2"]=string_var

AttributeError: 'str' object has no attribute 'loc'

# Q6. What do you understand about the windows function in pandas and list the types of windows functions?

# ans.. windows function in pandas can be broadly divied into three categories namely aggreate ,ranking and value the group by aggregate function can be used to partition and group the entire data frame by some column

# Q7. Write a code to print only the current month and year at the time of answering this question.

In [15]:
df3=pd.DataFrame({"date":['2023-7-26']})

In [16]:
df3

        date
0  2023-7-26

In [17]:
df3['updtaed_date']=pd.to_datetime(df3['date'])

In [18]:
df3

        date updtaed_date
0  2023-7-26   2023-07-26

In [19]:
df3['year']=df3['updated_date'].dt.year

KeyError: 'updated_date'

# Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) andcalculates the difference between them in days, hours, and minutes using Pandas time delta. The program should prompt the user to enter the dates and display the result.

In [44]:
import pandas as pd

In [43]:
date1=input("enter the first date :")

enter the first date :2023-07-28

In [28]:
date2=input("enter the secand date :")

enter the secand date :2000-08-26

In [29]:
date1=pd.to_datetime(date1)

In [30]:
date2=pd.to_datetime(date2)

In [31]:
diff=abs(date1-date2)

In [32]:
diff

Timedelta('8361 days 00:00:00')

In [33]:
days=diff.days

In [34]:
days

8361

# Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified column to a categorical data type. The program should prompt the user to enter the file path, column name, and category order, and then display the sorted data.

In [45]:
df5=pd.read_csv("datasets_11657_16098_train.csv")

In [46]:
df5.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [55]:
df5=df5[['Name','Sex','Ticket','Cabin','Embarked']]

In [56]:
type(df5['Name'])

pandas.core.series.Series

In [57]:
df5

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [58]:
type(df5)

pandas.core.frame.DataFrame

# Q10. Write a Python program that reads a CSV file containing sales data for different products and the data using a stacked bar chart to show the sales of each product category over time. The program should prompt the user to enter the file path and display the chart.

In [60]:
df6=pd.read_csv("1.04. Real-life example.csv")

In [62]:
df6.head(3)

,Brand,Price,Body,Mileage,EngineV,Engine Type,Registration,Year,Model
0,BMW,4200.0,sedan,277,2.0,Petrol,yes,1991,320
1,Mercedes-Benz,7900.0,van,427,2.9,Diesel,yes,1999,Sprinter 212
2,Mercedes-Benz,13300.0,sedan,358,5.0,Gas,yes,2003,S 500

In [64]:
pd.bar(df6)

AttributeError: module 'pandas' has no attribute 'bar'